n5/src/Documents/InternalOrder/InternalOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InternalOrder</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.Allocation</registerRecords>
  <registerRecords>AccumulationRegister.InternalOrders</registerRecords>
  <registerRecords>AccumulationRegister.Provision</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Process</name>
    <type>
      <types>BusinessProcessRef.InternalOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.Resolutions</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Information</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.ChangeReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>EnumRef.Performers</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/InternalOrderStatuses/InternalOrderStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InternalOrderStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.InternalOrderPoints</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/AccumulationRegisters/InternalOrders/InternalOrders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InternalOrders</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <dimensions>
    <name>InternalOrder</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>CatalogRef.RowKeys</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/Enums/InternalOrderPoints/InternalOrderPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>InternalOrderPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>DepartmentHeadResolution</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Delivery</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/InternalOrder/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Env;
var Command;
var Task;
var RoutePoint;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )

	checkWarehouse ( CheckedAttributes );
	if ( not DeliveryRows.Check ( ThisObject, "Items" )
		or not DeliveryRows.Check ( ThisObject, "Services" ) ) then
		Cancel = true;
		return;
	endif; 
	
EndProcedure

Procedure checkWarehouse ( CheckedAttributes )
	
	if ( Items.Count () > 0 ) then
		CheckedAttributes.Add ( "Warehouse" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	defineCommand ();
	defineTask ();
	SetPrivilegedMode ( true );
	if ( DeletionMark ) then
		if ( not canRemove () ) then
			Cancel = true;
		endif; 
		removeRelations ();
		return;
	else
		if ( isRemoved () ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	createProcess ();
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure defineCommand ()
	
	if ( Action.IsEmpty () ) then
		Command = undefined;
	else
		Command = Action;
		Action = undefined;
	endif; 
	
EndProcedure 

Procedure defineTask ()
	
	if ( IsNew () ) then
		Task = undefined;
		RoutePoint = Enums.InternalOrderPoints.New;
	else
		getTask ();
		Task = ? ( Env.Tasks = undefined, undefined, Env.Tasks.Task );
		RoutePoint = ? ( Env.Statuses = undefined, Enums.InternalOrderPoints.New, Env.Statuses.Status );
	endif;
	
EndProcedure 

Procedure getTask ()
	
	s = "
	|// @Tasks
	|select top 1 Tasks.Ref as Task
	|from Task.Task.TasksByExecutive ( &Performer, BusinessProcess = &Process ) as Tasks
	|where not Tasks.Executed
	|and not Tasks.DeletionMark
	|;
	|// @Statuses
	|select Statuses.Status as Status
	|from InformationRegister.InternalOrderStatuses as Statuses
	|where Statuses.Document = &Ref
	|";
	Env = SQL.Create ( s );
	Env.Q.SetParameter ( "Performer", Performer );
	Env.Q.SetParameter ( "Process", Process );
	Env.Q.SetParameter ( "Ref", Ref );
	SQL.Perform ( Env );
	
EndProcedure

Function canRemove ()
	
	if ( IsInRole ( "Administrator" ) ) then
		return true;
	endif; 
	if ( not Process.IsEmpty () ) then
		Output.OrderCannotBeChanged ();
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure removeRelations ()
	
	BP.RemoveTasks ( Process );
	BP.Remove ( Process );
	Process = undefined;
	Posting.ClearRecords ( RegisterRecords );
	removeStatus ();
	
EndProcedure 

Procedure removeStatus ()
	
	record = InformationRegisters.InternalOrderStatuses.CreateRecordManager ();
	record.Document = Ref;
	record.Delete ();
	
EndProcedure 

Function isRemoved ()
	
	if ( IsNew () or IsInRole ( "Administrator" ) ) then
		return false;
	endif; 
	removed = DF.Pick ( Ref, "DeletionMark as DeletionMark" );
	if ( removed ) then
		Output.DocumentIsRemoved ();
		return true;
	endif; 
	return false;
	
EndFunction 

Procedure createProcess ()
	
	if ( Command <> Enums.Actions.SendToApproval ) then
		return;
	endif; 
	if ( IsNew () ) then
		SetNewObjectRef ( Documents.InternalOrder.GetRef ( new UUID () ) );
		documentRef = GetNewObjectRef ();
	else
		documentRef = Ref;
	endif; 
	approval = BusinessProcesses.InternalOrder.CreateBusinessProcess ();
	approval.Date = CurrentSessionDate ();
	approval.InternalOrder = documentRef;
	approval.Write ();
	Process = approval.Ref;
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	SetPrivilegedMode ( true );
	if ( not performCommand () ) then
		Cancel = true;
		return;
	endif; 
	sendEmails ();
	
EndProcedure

Function performCommand ()
	
	cmd = Enums.Actions;
	if ( Command = undefined ) then
		return true;
	elsif ( Command = cmd.SendToApproval ) then
		startProcess ();
		if ( mustBePosted () ) then
			return post ();
		endif; 
	elsif ( Command = cmd.CompleteApproval ) then
		executeTask ();
		return post ();
	elsif ( Command = cmd.CompleteEdition ) then
		if ( mustBePosted () ) then
			return post ();
		endif; 
	elsif ( Command = cmd.CompleteDelivery ) then
		if ( balanceExists () ) then
			return false;
		else
			executeTask ();
		endif; 
	elsif ( Command = cmd.Reject ) then
		clearRecords ();
		executeTask ();
	else
		executeTask ();
	endif; 
	return true;
	
EndFunction 

Procedure startProcess ()
	
	obj = Process.GetObject ();
	obj.Start ();
	
EndProcedure

Procedure executeTask ()
	
	obj = Task.GetObject ();
	obj.ExecuteTask ();
	
EndProcedure 

Function post ()
	
	Env = Posting.GetParams ( Ref, RegisterRecords );
	return Documents.InternalOrder.Post ( Env );
	
EndFunction 

Function mustBePosted ()
	
	s = "
	|select top 1 1
	|from Task.Task as Tasks
	|where Tasks.BusinessProcess in ( select Process from Document.InternalOrder where Ref = &Ref )
	|and not Tasks.DeletionMark
	|and ( Tasks.RoutePoint = value ( BusinessProcess.InternalOrder.RoutePoint.Delivery )
	|	or ( Tasks.BusinessProcess.Completed
	|		and &Resolution = value ( Enum.Resolutions.Approve ) ) )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Resolution", Resolution );
	return not q.Execute ().IsEmpty ();
	
EndFunction 

Procedure clearRecords ()
	
	Posting.ClearRecords ( RegisterRecords );
	
EndProcedure 

Function balanceExists ()
	
	s = "
	|select top 1 1
	|from AccumulationRegister.InternalOrders.Balance ( , InternalOrder = &Ref ) as Balances
	|where Balances.QuantityBalance > 0
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	error = q.Execute ().Select ().Next ();
	if ( error ) then
		Output.InternalOrderClosingError ();
	endif; 
	return error;
	
EndFunction 

Procedure sendEmails ()
	
	if ( Command = undefined
		or Command = Enums.Actions.CompleteEdition ) then
		return;
	endif; 
	p = new Structure ();
	p.Insert ( "Ref", Ref );
	p.Insert ( "Sender", Performer );
	p.Insert ( "LastRoutePoint", RoutePoint );
	p.Insert ( "Process", Process );
	args = new Array ();
	args.Add ( p );
	Jobs.Run ( "InternalOrderMailing.Send", args, , , TesterCache.Testing () );
	
EndProcedure 

#endif
